<!DOCTYPE html>
<html>
<head>
    <title>ქართული კინო</title>
</head>
<body>
    <h1>ქართული კინოს სამყარო</h1>
    <center>
        <img src="kino.jpg" alt="ქართული კინოს სურათი">
    </center>
    <p>ქართული კინო არის მდიდარი და მრავალფეროვანი. აქ შეგიძლიათ გაეცნოთ ქართველი რეჟისორების ფილმებს, მსახიობებს და კინემატოგრაფიის ისტორიას.</p>
    <hr>
    <h2>ცნობილი ქართველი რეჟისორები</h2>
    <ul>
        <li>ოტარ იოსელიანი</li>
        <li>ტენგიზ აბულაძე</li>
        <li>გიორგი შენგელაია</li>
    </ul>
</body>
</html>