numbers = (2, 56, 99, 22, 15, 23, 66, 11, 134, 23, 66, 91, 22, 2, 23)

# 23-ის გამეორების დათვლა
count_23 = numbers.count(23)
print(f"23 მეორდება {count_23} -ჯერ")

my_tuple = ("apple", "banana", "cherry", "date")

# პირველი ორი ელემენტის დაბეჭდვა slicing-ის გამოყენებით
print(my_tuple[:2])

# ან ცალ-ცალკე ინდექსების გამოყენებით
print(my_tuple[0])
print(my_tuple[1])

aura = (10, 25, 5, 80, 70, 20)

# 10-ზე დიდი რიცხვების დაბეჭდვა
for number in aura:
    if number > 10:
        print(number)

# List (სია) არის ცვალებადი (mutable) მონაცემთა ტიპი. ეს ნიშნავს, რომ სიის შექმნის შემდეგ შეგვიძლია მასში ელემენტების დამატება, წაშლა ან შეცვლა.
my_list = [1, 2, 3]
my_list.append(4)  # ელემენტის დამატება
my_list[0] = 10    # ელემენტის შეცვლა
del my_list[1]     # ელემენტის წაშლა
print(my_list) #დაბეჭდავს [10,3,4]

# Tuple (კორტეჟი) არის უცვლელი (immutable) მონაცემთა ტიპი. ეს ნიშნავს, რომ tuple-ის შექმნის შემდეგ მისი შეცვლა შეუძლებელია.
my_tuple = (1, 2, 3)
# my_tuple.append(4)  # გამოიწვევს შეცდომას
# my_tuple[0] = 10    # გამოიწვევს შეცდომას
# del my_tuple[1]     # გამოიწვევს შეცდომას

#Tuple-ს ვიყენებთ მაშინ, როდესაც გვინდა მონაცემების დაცვა შემთხვევითი ცვლილებებისგან.